# custom_components/alarms_and_reminders/sentences/ar/alarms.py
DEFAULT_SENTENCES = {
    "language": "ar",
    "intents": {
        "SetAlarm_AR": {
            "data": [
                {
                    "sentences": [
                        "اضبط منبه (على|عند|ل) {datetime}",
                        "اضبط (ال|)منبه (على|عند|ل) {datetime}",
                        "(أيقظني|نبهني) (في|عند|الساعة) {datetime}",
                        "منبه (على|عند|ل) {datetime}",
                        "حط منبه (على|عند|ل) {datetime}"
                    ]
                }
            ]
        },
        "StopAlarm_AR": {
            "data": [
                {
                    "sentences": [
                        "(اوقف|اطفي|الغي) (ال|)منبه",
                        "(اوقف|اطفي|الغي) المنبه",
                        "(عطل|الغي) المنبه"
                    ]
                }
            ]
        },
        "SnoozeAlarm_AR": {
            "data": [
                {
                    "sentences": [
                        "غفوة (ال|)منبه",
                        "غفوة (ل|) {minutes} (دقيقة|دقائق)",
                        "(اعطيني|خليني) {minutes} (دقيقة|دقائق) (زيادة|كمان|أخرى)",
                        "اخر (ال|)منبه {minutes} (دقيقة|دقائق)"
                    ]
                }
            ]
        }
    },
    "lists": {
        "datetime": {
            "type": "text",
            "values": [
                "في {time}",
                "(على|عند) (الساعة|) {time}",
                "{time} (يوم|في) {date}",
                "اليوم (على|عند) (الساعة|) {time}",
                "غدا (على|عند) (الساعة|) {time}",
                "بعد غد (على|عند) (الساعة|) {time}",
                "(يوم|في) {date} (على|عند) (الساعة|) {time}"
            ]
        },
        "time": {
            "type": "text",
            "values": [
                "(الساعة|) {hour}:{minute} (صباحا|صباحاً)",
                "(الساعة|) {hour}:{minute} (مساء|مساءً)",
                "(الساعة|) {hour} و {minute} (دقيقة|) (صباحا|صباحاً)",
                "(الساعة|) {hour} و {minute} (دقيقة|) (مساء|مساءً)",
                "(الساعة|) {hour} (صباحا|صباحاً)",
                "(الساعة|) {hour} (مساء|مساءً)"
            ]
        },
        "hour": {
            "type": "number",
            "range": {
                "from": 1,
                "to": 12
            }
        },
        "minute": {
            "type": "number",
            "range": {
                "from": 0,
                "to": 59,
                "step": 1
            }
        },
        "date": {
            "type": "text",
            "values": [
                "(الاثنين|الإثنين)",
                "الثلاثاء",
                "(الاربعاء|الأربعاء)",
                "الخميس",
                "الجمعة",
                "السبت",
                "(الاحد|الأحد)",
                "(الاثنين|الإثنين) (الجاي|القادم)",
                "الثلاثاء (الجاي|القادم)",
                "(الاربعاء|الأربعاء) (الجاي|القادم)",
                "الخميس (الجاي|القادم)",
                "الجمعة (الجاية|القادمة)",
                "السبت (الجاي|القادم)",
                "(الاحد|الأحد) (الجاي|القادم)"
            ]
        },
        "minutes": {
            "type": "number",
            "range": {
                "from": 1,
                "to": 60
            }
        }
    }
}