# custom_components/alarms_and_reminders/sentences/ar/reminders.py
DEFAULT_SENTENCES = {
    "language": "ar",
    "intents": {
        "SetReminder_AR": {
            "data": [
                {
                    "sentences": [
                        "(ذكرني|فكرنى) (ب|ان) {task} (على|عند|في) {datetime}",
                        "(اضبط|أنشئ|ضع|حط) تذكير (ب|ل|عن) {task} (على|عند|في) {datetime}",
                        "حط تذكير (ب|ل|عن) {task} (على|عند|في) {datetime}",
                        "انشئ تذكير (ب|ل|عن) {task} (على|عند|في) {datetime}"
                    ]
                }
            ]
        },
        "StopReminder_AR": {
            "data": [
                {
                    "sentences": [
                        "(اوقف|اطفي|الغي) (ال|)تذكير",
                        "(اوقف|اطفي|الغي) التذكير",
                        "(عطل|احذف) التذكير"
                    ]
                }
            ]
        },
        "SnoozeReminder_AR": {
            "data": [
                {
                    "sentences": [
                        "غفوة (ال|)تذكير",
                        "غفوة (ال|)تذكير (ل|) {minutes} (دقيقة|دقائق)",
                        "ذكرني (مرة|) (ثانية|تانية) (بعد|في) {minutes} (دقيقة|دقائق)",
                        "اخر (ال|)تذكير {minutes} (دقيقة|دقائق)"
                    ]
                }
            ]
        }
    },
    "lists": {
        "task": {
            "type": "text",
            "values": []
        },
        "datetime": {
            "type": "text",
            "values": [
                "في {time}",
                "(على|عند) (الساعة|) {time}",
                "{time} (يوم|في) {date}",
                "اليوم (على|عند) (الساعة|) {time}",
                "غدا (على|عند) (الساعة|) {time}",
                "بعد غد (على|عند) (الساعة|) {time}",
                "(يوم|في) {date} (على|عند) (الساعة|) {time}"
            ]
        },
        "time": {
            "type": "text",
            "values": [
                "(الساعة|) {hour}:{minute} (صباحا|صباحاً)",
                "(الساعة|) {hour}:{minute} (مساء|مساءً)",
                "(الساعة|) {hour} و {minute} (دقيقة|) (صباحا|صباحاً)",
                "(الساعة|) {hour} و {minute} (دقيقة|) (مساء|مساءً)",
                "(الساعة|) {hour} (صباحا|صباحاً)",
                "(الساعة|) {hour} (مساء|مساءً)"
            ]
        },
        "hour": {
            "type": "number",
            "range": {
                "from": 1,
                "to": 12
            }
        },
        "minute": {
            "type": "number",
            "range": {
                "from": 0,
                "to": 59,
                "step": 1
            }
        },
        "date": {
            "type": "text",
            "values": [
                "(الاثنين|الإثنين)",
                "الثلاثاء",
                "(الاربعاء|الأربعاء)",
                "الخميس",
                "الجمعة",
                "السبت",
                "(الاحد|الأحد)",
                "(الاثنين|الإثنين) (الجاي|القادم)",
                "الثلاثاء (الجاي|القادم)",
                "(الاربعاء|الأربعاء) (الجاي|القادم)",
                "الخميس (الجاي|القادم)",
                "الجمعة (الجاية|القادمة)",
                "السبت (الجاي|القادم)",
                "(الاحد|الأحد) (الجاي|القادم)"
            ]
        },
        "minutes": {
            "type": "number",
            "range": {
                "from": 1,
                "to": 60
            }
        }
    }
}